# a = [1, 2, 3, 4, 5]
# for item in a:
#     print(item)


# Перебрать с помощью цикла while
# каждый элемент печатаем с новой строки

# Перебрать с помощью цикла for с использованием range (по индексам)
# каждый элемент печатаем с новой строки

# Перебрать список с помощью цикла for
# каждый элемент печатаем с новой строки

data = [123, '1', 2, 3.0, 5, True, None, [], 4]
index = 0
# while index < len(data):
#     print(data[index])
#     index = index + 1

for item in range(len(data)):  # [0, 1, 2, 3, 4, 5, 6, 7, 8]
    print(data[item])

# for item in data:
#     print(item)

# 1 - пользователь вводит целое положительно число - количество запрашиваемых данных
# 2 - пользователь вводит поочередно целые числа
# 3 - мы добавляем нечетные числа в список
# 4 - поэлементно выводим числа из списка умноженные на 2

# 5
# 9
# 3
# 5
# 9
# 5

# 18
# 6
# 10
# 18
# 10

# for item in range(10):
#     print("Hello, world!")

# найти все простые числа в диапазоне от 1 до 100
