# n (4, ...)
# *
# **
# ***
# ****
#
# *
# **
# ***
# ****
# *****

# Через цикл while и через цикл for

# data = [1, 2, 3]
# for item in data:
#     ...

# один проход по циклу - одна итерация

# LinkedList

# n (4, ...)
#    *
#   ***
#  *****
# *******

# n = 4
# i = 1 | 1 | 3 ((i * 2) - 1 | n - i)
# i = 2 | 3 | 2
# i = 3 | 5 | 1
# i = 4 | 7 | 0
# Через цикл while и через цикл for

# l = [1, 2, 3]
# l[2] = l[2] * 2
# print(l)

# Пользователь вводит число (количество запрашиваемых чисел)
# Пользователь вводит целые числа, мы сохраняем все введеные числа в список
# 1) Посчитать количество отрицательных чисел
# 2) Все положительные элементы списка умножить на 3
# 3) Вывести сам список

# 4
# -1
# 2
# -3
# 4

# Количество отрицательных чисел: 2
# [-1, 6, -3, 12]

matrix = [
    [1, 2, 3, 4],
    [-1, 9, 0, -2],
    [4, -2, 7, 1],
    [4, 2, 2, -9],
]
# посчитать количество отрицательных элементов в каждом столбце

# Количество отрицательных чисел в 1-ом: 1
# Количество отрицательных чисел в 2-ом: 1
# Количество отрицательных чисел в 3-ом: 0
# Количество отрицательных чисел в 4-ом: 2
# 1 2 3 4
# -1 9 0 -2
# 4 -2 7 1
# 4 2 2 -9

# 1 -1 4 4
# 2 9 -2 2
# 3 0 7 2
# 4 -2 1 -9
