# while True:
#     a = int(input())
#     if a % 2 == 0:
#         print("Число четное")
#         continue
#     break

# В цикле пользователь вводит целые числа
# Если число отрицательное - умножаем его на два и добавляем к сумме
# Если число положительное - возвращаемся к началу цикла
# Если 0 - прерываем цикл

# -2
# 3
# -4
# 0

# -12
sum_ = 0
while True:
    a = int(input())
    if a < 0:
        sum_ = (a * 2) + sum_
    elif a == 0:
        break

print(sum_)

if ...:
    print(...)
else:
    ...

while ...:
    ...

if ...:
    ...
elif ...:
    ...
else:
    ...

if ...:
    if ...:
        ...
else:
    ...
